CSI API ETABS v1
cDatabaseTables.SetLoadCasesSelectedForDisplay Method
 Sets the load cases that are selected for table display.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetLoadCasesSelectedForDisplay(
	ref string[] LoadCaseList
)
Function SetLoadCasesSelectedForDisplay (
	ByRef LoadCaseList As String()
) As Integer
Dim instance As cDatabaseTables
Dim LoadCaseList As String()
Dim returnValue As Integer
returnValue = instance.SetLoadCasesSelectedForDisplay(LoadCaseList)
int SetLoadCasesSelectedForDisplay(
	array<String^>^% LoadCaseList
)
abstract SetLoadCasesSelectedForDisplay :
        LoadCaseList : string[] byref -> int
Parameters
LoadCaseList
Type: System.String[]
Input Item: The zero-based list of load cases selected for table display.
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
Remarks
 This list sets the load cases that are included when displaying analysis results. If no load cases are to be selected then the LoadCaseList item should include a single blank string.
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace